clc,clear
syms a b;%定义符号变量
A=[1,1,1,1;0,1,2,2;0,-1,(a-3),-2;3,2,1,a];%系数矩阵
B=[0,1,b,-1];%常数项矩阵
ZA=[1,1,1,1,0;0,1,2,2,1;0,-1,(a-3),-2,b;3,2,1,a,-1];%增广矩阵
RA=rank(A);     % 系数矩阵的秩
RB=rank(ZA);   % 增广矩阵的秩
XA=rref(A)       % 把系数矩阵化成行最简形
XZA=rref(ZA)   % 把增广矩阵化成行最简形
a=input('a=?'); %给出a的值
b=input('b=?');%给出b的值

%根据稀疏矩阵和增广矩阵的秩与维数关系，判定是否无解，唯一解，无穷多解的情况
%,无解：系数矩阵与增广矩阵的秩不相等，均小于矩阵维数
if(a==1&&b~=-1)
    A1=eval(A);       % 替换系数矩阵a的值
    ZA1=eval(ZA);   % 替换增广矩阵a的值
    disp('系数矩阵与增广矩阵的秩不相等，均小于矩阵维数，所以方程组无解');
    disp('系数矩阵化成行最简形'),X1=rref(A1)        % 把系数矩阵化成行最简形
    disp('增广矩阵化成行最简形'),X2=rref(ZA1)      % 把增广矩阵化成行最简形
    RA=rank(A1);     % 系数矩阵的秩
    RB=rank(ZA1);    % 增广矩阵的秩
    disp(['RA=',num2str(RA)]); % 输出系数矩阵的秩
    disp(['RB=',num2str(RB)]); % 输出增广矩阵的秩
    disp(' 无解')
end
%唯一解：系数矩阵与增广矩阵的秩相等，均为矩阵维数
if a~=1
    A2=eval(A);      % 替换系数矩阵a的值
    ZA2=eval(ZA);  % 替换增广矩阵a的值
    B=eval(B);        % 替换常数项矩阵b的值
    disp('系数矩阵与增广矩阵的秩相等，均为矩阵维数，所以方程组有唯一解'),
    disp('系数矩阵化成行最简形'),X1=rref(A2),     % 把系数矩阵化成行最简形
    disp('增广矩阵化成行最简形'),X2=rref(ZA2)      % 把增广矩阵化成行最简形
    RA=rank(A2);    % 输出系数矩阵的秩
    RB=rank(ZA2);  % 输出增广矩阵的秩
    disp(['RA=',num2str(RA)]); % 输出系数矩阵的秩
    disp(['RB=',num2str(RB)]); % 输出增广矩阵的秩
    disp(' 唯一解'),X=inv(A2)*B'        % 唯一解
end
%无穷多解：系数矩阵与增广矩阵的秩相等，均小于矩阵维数
if a==1&&b==-1
    A3=eval(A);     % 替换系数矩阵a的值
    ZA3=eval(ZA); % 替换增广矩阵a的值
    B=eval(B);       % 替换常数项矩阵b的值
    disp('系数矩阵与增广矩阵的秩相等，均小于矩阵维数，所以方程组有无穷多解'),
    disp('系数矩阵化成行最简形'),X1=rref(A3),    % 把系数矩阵化成行最简形
    disp('增广矩阵化成行最简形'),X2=rref(ZA3)      % 把增广矩阵化成行最简形
    RA=rank(A3);  % 输出系数矩阵的秩
    RB=rank(ZA3); % 输出增广矩阵的秩
    disp(['RA=',num2str(RA)]); % 输出系数矩阵的秩
    disp(['RB=',num2str(RB)]); % 输出增广矩阵的秩
    disp('特解'),x0=pinv(A3)*B'    % 特解
    disp('基础解系'),x=null(A3,'r')  % 基础解系
end
